; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 6087)
	(= (fuel plane1) 1059)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city0)
	(= (capacity plane2) 8287)
	(= (fuel plane2) 2328)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city3)
	(= (capacity plane3) 10051)
	(= (fuel plane3) 3059)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 2)
	(at plane4 city2)
	(= (capacity plane4) 10020)
	(= (fuel plane4) 91)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 9)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 10)
	(at person1 city1)
	(at person2 city0)
	(at person3 city1)
	(at person4 city1)
	(at person5 city1)
	(at person6 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 567)
	(= (distance city0 city2) 981)
	(= (distance city0 city3) 899)
	(= (distance city1 city0) 567)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 701)
	(= (distance city1 city3) 542)
	(= (distance city2 city0) 981)
	(= (distance city2 city1) 701)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 902)
	(= (distance city3 city0) 899)
	(= (distance city3 city1) 542)
	(= (distance city3 city2) 902)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane4 city0)
	(at person1 city1)
	(at person2 city1)
	(at person3 city0)
	(at person4 city3)
	(at person5 city3)
	(at person6 city2)
	))

(:metric minimize (+ (* 4 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane4 city2)
   changed: (fuel plane4) from 91 to 10020
   goals met: 1 of 7
2. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 0 to 1701, (fuel plane2) from 2328 to 627
   goals met: 1 of 7
3. (fly plane4 city2 city1)
   deleted: (at plane4 city2)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 1701 to 4505, (fuel plane4) from 10020 to 7216
   goals met: 1 of 7
4. (board person3 plane4 city1)
   deleted: (at person3 city1)
   added: (in person3 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 7
5. (board person4 plane4 city1)
   deleted: (at person4 city1)
   added: (in person4 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 1 of 7
6. (board person5 plane4 city1)
   deleted: (at person5 city1)
   added: (in person5 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 1 of 7
7. (fly plane4 city1 city3)
   deleted: (at plane4 city1)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 4505 to 6673, (fuel plane4) from 7216 to 5048
   goals met: 1 of 7
8. (debark person4 plane4 city3)
   deleted: (in person4 plane4)
   added: (at person4 city3)
   changed: (onboard plane4) from 3 to 2
   goals met: 2 of 7
9. (debark person5 plane4 city3)
   deleted: (in person5 plane4)
   added: (at person5 city3)
   changed: (onboard plane4) from 2 to 1
   goals met: 3 of 7
10. (board person6 plane4 city3)
   deleted: (at person6 city3)
   added: (in person6 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 3 of 7
11. (fly plane4 city3 city0)
   deleted: (at plane4 city3)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 6673 to 10269, (fuel plane4) from 5048 to 1452
   goals met: 4 of 7
12. (debark person3 plane4 city0)
   deleted: (in person3 plane4)
   added: (at person3 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 5 of 7
13. (board person2 plane4 city0)
   deleted: (at person2 city0)
   added: (in person2 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 5 of 7
14. (refuel plane4 city0)
   changed: (fuel plane4) from 1452 to 10020
   goals met: 5 of 7
15. (zoom plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 10269 to 15372, (fuel plane4) from 10020 to 4917
   goals met: 4 of 7
16. (debark person2 plane4 city1)
   deleted: (in person2 plane4)
   added: (at person2 city1)
   changed: (onboard plane4) from 2 to 1
   goals met: 5 of 7
17. (fly plane4 city1 city2)
   deleted: (at plane4 city1)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 15372 to 18176, (fuel plane4) from 4917 to 2113
   goals met: 5 of 7
18. (debark person6 plane4 city2)
   deleted: (in person6 plane4)
   added: (at person6 city2)
   changed: (onboard plane4) from 1 to 0
   goals met: 6 of 7
19. (refuel plane4 city2)
   changed: (fuel plane4) from 2113 to 10020
   goals met: 6 of 7
20. (zoom plane4 city2 city0)
   deleted: (at plane4 city2)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 18176 to 27005, (fuel plane4) from 10020 to 1191
   goals met: 7 of 7
